[
  {
    "path": "posts/2020-12-14-explanatory-irt-models-in-r/",
    "title": "Explanatory IRT Models in R",
    "description": "Explanatory item response modeling (EIRM) allow researchers to \nmodel both person and item characteristics as predictors. In this post, \nI demonstrate how to use the `eirm` package to estimate explanatory IRT \nmodels in R. \n\n(4 min read)",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2020-12-14",
    "categories": [
      "psychometrics",
      "IRT",
      "eirm"
    ],
    "contents": "\r\nExplanatory item response modeling (shortly EIRM) was first proposed by De Boeck and Wilson (2004). This framework allows us to turn traditional item response theory (IRT) models into explanatory models. Explanatory IRT models aim to explain how item properties (e.g., content, cognitive complexity, and presence of visual elements) and person characteristics (e.g., gender, race, and English language learner status) affect the persons’ responses to items. For a brief introduction to EIRM, you can check out Wilson, De Boeck, and Carstensen’s chapter here.\r\nIn De Boeck and Wilson (2004)’s book, the authors describe how to estimate explanatory IRT models using the SAS statistical software program. Given the growing popularity of R in the psychometric/measurement community, De Boeck et al. (2011) published a nice article that describes how to estimate the same models using the lme4 package (Bates et al. 2015) in R. Since then, I have been using the lme4 package to estimate explanatory IRT models for my research projects. For example, we evaluated measurement invariance of two developmental assets, Support and Positive Identity, across grade levels and ELL subgroups of Latino students in 6th through 12th grade (Bulut et al. 2015). Also, we examined whether the linguistic complexity of items leads to gender differential item functioning (DIF) on mathematics assessments (Kan and Bulut 2014).\r\nOne problem that we often had to deal with when using lme4 was the format of item responses. The lme4 assumes a binomial distribution for item responses, which means responses must be dichotomous (i.e., 0 and 1). Although this is not a problem for dichotomous data based on multiple-choice items, it is a major drawback for polytomous data based on rating scale items (e.g., Likert scales). Therefore, we had to create a new way to transform polytomous responses into dichotomous responses without losing the original response structure (Stanke and Bulut 2019). Recently, I decided to share this method in a new package that would faciliate the estimation of explanatory IRT models for both dichotomous and polytomous response data. Therefore, I created the eirm package (Bulut 2020), which is essentially a wrapper for the lme4 package (Bates et al. 2015). The eirm function in the package allows users to define an explanatory IRT model based on item-level and person-level predictors.\r\nExample\r\nIn this post, I will show how to use the eirm package to estimate explanatory IRT models with polytomous response data. For more examples, you can check out the eirm website prepared with pkgdown (Wickham and Hesselberth 2020): https://okanbulut.github.io/eirm/. The eirm package is currently available on CRAN. It can be downloaded and installed using install.packages(“eirm”).\r\nI will use the verbal aggression dataset in the lme4 package to demonstrate the estimation process. The dataset includes responses to a questionnaire on verbal aggression and additional variables related to items and persons. A preview of the data set is shown below:\r\n\r\n\r\nlibrary(\"eirm\")\r\n\r\ndata(\"VerbAgg\")\r\n\r\nhead(VerbAgg)\r\n\r\n\r\n  Anger Gender        item    resp id btype  situ mode r2\r\n1    20      M S1WantCurse      no  1 curse other want  N\r\n2    11      M S1WantCurse      no  2 curse other want  N\r\n3    17      F S1WantCurse perhaps  3 curse other want  Y\r\n4    21      F S1WantCurse perhaps  4 curse other want  Y\r\n5    17      F S1WantCurse perhaps  5 curse other want  Y\r\n6    21      F S1WantCurse     yes  6 curse other want  Y\r\n\r\nIn the data, the variable resp represents each person’s response to the items on the questionnaire. There are three values for resp: yes, perhaps, and no. Therefore, we need to transform these poytomous responses into dichotomous responses. To reformat the data, we will use the polyreformat function in the eirm package. The following example demonstrates how polytomous responses in the verbal aggression data set can be reformatted into a dichotomous form:\r\n\r\n\r\nVerbAgg2 <- polyreformat(data=VerbAgg, id.var = \"id\", var.name = \"item\", val.name = \"resp\")\r\n\r\nhead(VerbAgg2)\r\n\r\n\r\n  Anger Gender        item    resp id btype  situ mode r2\r\n1    20      M S1WantCurse      no  1 curse other want  N\r\n2    11      M S1WantCurse      no  2 curse other want  N\r\n3    17      F S1WantCurse perhaps  3 curse other want  Y\r\n4    21      F S1WantCurse perhaps  4 curse other want  Y\r\n5    17      F S1WantCurse perhaps  5 curse other want  Y\r\n6    21      F S1WantCurse     yes  6 curse other want  Y\r\n  polycategory polyresponse                polyitem\r\n1  cat_perhaps            0 S1WantCurse.cat_perhaps\r\n2  cat_perhaps            0 S1WantCurse.cat_perhaps\r\n3  cat_perhaps            1 S1WantCurse.cat_perhaps\r\n4  cat_perhaps            1 S1WantCurse.cat_perhaps\r\n5  cat_perhaps            1 S1WantCurse.cat_perhaps\r\n6  cat_perhaps           NA S1WantCurse.cat_perhaps\r\n\r\nIn the reformatted data, polyresponse is the new response variable (i.e., pseudo-dichotomous version of the original response variable resp) and polycategory represents the response categories. Based on the reformatted data, each item has two rows (number of response categories - 1) based on the following rules:\r\nIf polycategory = “cat_perhaps” and resp = “no”, then polyresponse = 0\r\nIf polycategory = “cat_perhaps” and resp = “perhaps”, then polyresponse = 1\r\nIf polycategory = “cat_perhaps” and resp = “yes”, then polyresponse = NA\r\nand\r\nIf polycategory = “cat_yes” and resp = “no”, then polyresponse = NA\r\nIf polycategory = “cat_yes” and resp = “perhaps”, then polyresponse = 0\r\nIf polycategory = “cat_yes” and resp = “yes”, then polyresponse = 1\r\nNow we can estimate an explanatory IRT model using the reformatted data. The following model explains only the first threshold (i.e., threshold from no to perhaps) based on explanatory variables:\r\n\r\n\r\nmod1 <- eirm(formula = \"polyresponse ~ -1 + situ + btype + mode + (1|id)\", \r\n             data = VerbAgg2)\r\n\r\n\r\n\r\nThe regression-like formula polyresponse ~ -1 + situ + btype + mode + (1|id) describes the dependent variable (polyresponse) and predictors (situ, btype, and mode). Also, (1|id) refers to the random effects for persons represented by the id column in the data set. Using the print function or simply typing mod1 in the R console, we can print out the estimated coefficients for the predictors:\r\n\r\n\r\nprint(mod1)\r\n\r\n\r\nEIRM formula: \"polyresponse ~ -1 + situ + btype + mode + (1|id)\" \r\n\r\nNumber of persons: 316 \r\n\r\nNumber of observations: 9665 \r\n\r\nNumber of predictors: 5 \r\n\r\nParameter Estimates:\r\n\r\n           Easiness    S.E. z-value    p-value\r\nsituother    0.4846 0.06628   7.312  2.626e-13\r\nsituself    -0.2239 0.06548  -3.419  6.277e-04\r\nbtypescold  -0.5936 0.05334 -11.128  9.208e-29\r\nbtypeshout  -1.2387 0.05810 -21.319 7.562e-101\r\nmodedo      -0.4264 0.04576  -9.319  1.179e-20\r\n\r\nNote: The estimated parameters above represent 'easiness'.\r\nUse difficulty = TRUE to get difficulty parameters.\r\n\r\nThe mod1 object is essentially a glmerMod-class object from the lme4 package (Bates et al. 2015). All glmerMod results for the estimated model can seen with mod1$model. For example, estimated random effects for persons (i.e., theta estimates) can be obtained using:\r\n\r\n\r\ntheta <- ranef(mod1$model)$id\r\nhead(theta)\r\n\r\n\r\n\r\nIt is possible to visualize the parameters using an item-person map. Note that this plot is a modified version of the plotPImap function from the eRm package (Mair, Hatzinger, and Maier 2020). Aesthetic elements such as axis labels and plot title can be added to the plot (see ?plot.eirm for further details).\r\n\r\n\r\nplot(mod1)\r\n\r\n\r\n\r\n\r\nThe previous model could be modified to explain the first threshold (i.e., threshold from no to perhaps) and second threshold (perhaps to yes) based on explanatory variables using the following codes:\r\n\r\n\r\nmod2 <- eirm(formula = \"polyresponse ~ -1 + btype + situ + mode + \r\n             polycategory + polycategory:btype + (1|id)\", data = VerbAgg2)\r\n\r\n\r\n\r\nBefore I conclude this post, I want to mention a few caveats with the eirm package. As the size of dataset (i.e., items and persons), the estimation duration may increase significantly.\r\n\r\n\r\n\r\nBates, Douglas, Martin Mächler, Ben Bolker, and Steve Walker. 2015. “Fitting Linear Mixed-Effects Models Using lme4.” Journal of Statistical Software 67 (1): 1–48. https://doi.org/10.18637/jss.v067.i01.\r\n\r\n\r\nBulut, Okan. 2020. Eirm: Explanatory Item Response Modeling for Dichotomous and Polytomous Items. https://CRAN.R-project.org/package=eirm.\r\n\r\n\r\nBulut, Okan, Jose Palma, Michael C. Rodriguez, and Luke Stanke. 2015. “Evaluating Measurement Invariance in the Measurement of Developmental Assets in Latino English Language Groups Across Developmental Stages.” SAGE Open 5 (2): 2158244015586238. https://doi.org/10.1177/2158244015586238.\r\n\r\n\r\nDe Boeck, Paul, Marjan Bakker, Robert Zwitser, Michel Nivard, Abe Hofman, Francis Tuerlinckx, Ivailo Partchev, and others. 2011. “The Estimation of Item Response Models with the Lmer Function from the Lme4 Package in R.” Journal of Statistical Software 39 (12): 1–28.\r\n\r\n\r\nDe Boeck, Paul, and Mark Wilson. 2004. Explanatory Item Response Models: A Generalized Linear and Nonlinear Approach. Springer Science & Business Media.\r\n\r\n\r\nKan, Adnan, and Okan Bulut. 2014. “Examining the Relationship Between Gender Dif and Language Complexity in Mathematics Assessments.” International Journal of Testing 14 (3): 245–64. https://doi.org/10.1080/15305058.2013.877911.\r\n\r\n\r\nMair, Patrick, Reinhold Hatzinger, and Marco Johannes Maier. 2020. eRm: Extended Rasch Modeling. https://cran.r-project.org/package=eRm.\r\n\r\n\r\nStanke, Luke, and Okan Bulut. 2019. “Explanatory Item Response Models for Polytomous Item Responses.” International Journal of Assessment Tools in Education 6 (2): 259–78.\r\n\r\n\r\nWickham, Hadley, and Jay Hesselberth. 2020. Pkgdown: Make Static Html Documentation for a Package. https://CRAN.R-project.org/package=pkgdown.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-12-14-explanatory-irt-models-in-r/explanatory-irt-models-in-r_files/figure-html5/unnamed-chunk-7-1.png",
    "last_modified": "2020-12-15T16:53:16-07:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
